Tekla.Structures.Drawing.DatabaseObject.PropertyType
Type of property: int/double/string

Tekla.Structures.Drawing.DatabaseObject.PropertyType.TYPE_INT
Integer

Tekla.Structures.Drawing.DatabaseObject.PropertyType.TYPE_DOUBLE
Double

Tekla.Structures.Drawing.DatabaseObject.PropertyType.TYPE_STRING
String